In [1]:
import pandas as pd

In [2]:
wc_2019 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 2019.csv')
wc_2019

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2019.0,ENG,311,8,10,SA,WON,LONDON,ENGLAND
2,NaN,NaN,334,9,8,PAK,LOST,NOTTINGHAM,NaN
3,NaN,NaN,386,6,10,BAN,WON,CARDIFF,NaN
4,NaN,NaN,231,2,10,WI,WON,SOUTHAMPTON,NaN
...,...,...,...,...,...,...,...,...,...
101,NaN,NaN,268,7,10,WI,WON,MANCHESTER,NaN
102,NaN,NaN,306,5,7,ENG,WON,BIRMINGHAM,NaN
103,NaN,NaN,314,9,10,BAN,WON,BIRMINGHAM,NaN
104,NaN,NaN,265,3,7,SL,WON,LEEDS,NaN
105,NaN,NaN,221,10,8,NZ,LOST,MANCHESTER,NaN

In [3]:
wc_2015 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 2015.csv')
wc_2015

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2015.0,NZ,331,6,10,SL,WON,CHRISTCHURCH,AUSTRALIA
2,NaN,NaN,146,7,10,SCO,WON,DUNEDIN,NaN
3,NaN,NaN,125,2,10,ENG,WON,WELLINGTON,NaN
4,NaN,NaN,152,9,10,AUS,WON,AUCKLAND,NaN
...,...,...,...,...,...,...,...,...,...
107,NaN,NaN,232,10,6,SL,LOST,DUNEDIN,NaN
108,NaN,NaN,211,9,10,SCO,WON,DUNEDIN,NaN
109,NaN,NaN,142,10,6,AUS,LOST,PERTH,NaN
110,NaN,NaN,186,10,4,NZ,LOST,NAPIER,NaN
111,NaN,NaN,111,7,1,ENG,LOST,SYDNEY,NaN

In [4]:
wc_2011 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 2011.csv')
wc_2011

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2011.0,BAN,283,9,4,IND,LOST,DHAKA,INDIA
2,NaN,NaN,205,10,10,IRE,WON,DHAKA,NaN
3,NaN,NaN,58,10,1,WI,LOST,DHAKA,NaN
4,NaN,NaN,227,8,10,ENG,WON,CHATTOGRAM,NaN
...,...,...,...,...,...,...,...,...,...
107,NaN,NaN,329,7,8,ENG,WON,BENGALURU,NaN
108,NaN,NaN,207,10,5,IND,LOST,BENGALURU,NaN
109,NaN,NaN,231,10,10,WI,LOST,MOHALI,NaN
110,NaN,NaN,141,10,7,SA,LOST,KOLKATA,NaN
111,NaN,NaN,307,4,10,NED,WON,KOLKATA,NaN

In [5]:
wc_2007 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 2007.csv')
wc_2007

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2007.0,WI,241.0,9.0,10.0,PAK,WON,JAMAICA,AUSTRALIA
2,NaN,NaN,204.0,4.0,5.0,ZIM,WON,JAMAICA,NaN
3,NaN,NaN,190.0,2.0,8.0,IRE,WON,JAMAICA,NaN
4,NaN,NaN,219.0,10.0,6.0,AUS,LOST,ANTIGUA,NaN
...,...,...,...,...,...,...,...,...,...
113,NaN,NaN,131.0,10.0,5.0,WI,LOST,BARBADOS,NaN
114,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
115,NaN,IND,191.0,10.0,5.0,BAN,LOST,TRINIDAD,NaN
116,NaN,NaN,413.0,5.0,10.0,BER,WON,TRINIDAD,NaN
117,NaN,NaN,185.0,10.0,6.0,SL,LOST,TRINIDAD,NaN

In [6]:
wc_2003 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 2003.csv')
wc_2003

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2003.0,SA,278,5,9,WI,LOST,CAPE TOWN,AUSTRALIA
2,NaN,NaN,142,0,10,KEN,WON,POTCHEFSTROOM,NaN
3,NaN,NaN,306,6,1,NZ,LOST,JOHANNESBERG,NaN
4,NaN,NaN,109,0,10,BAN,WON,BLOEMFONTEIN,NaN
...,...,...,...,...,...,...,...,...,...
117,NaN,NaN,144,4,9,NED,WON,EAST LONDON,NaN
118,NaN,NaN,272,10,9,NAM,WON,GQEBERHA,NaN
119,NaN,NaN,246,8,10,PAK,WON,CAPE TOWN,NaN
120,NaN,NaN,168,10,9,IND,LOST,DURBAN,NaN
121,NaN,NaN,204,8,8,AUS,LOST,GQEBERHA,NaN

In [7]:
wc_1999 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 1999.csv')
wc_1999

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1999.0,ENG,207.0,2,10,SL,WON,LONODN,AUSTRALIA
2,NaN,NaN,204.0,1,10,KEN,WON,CANTERBURY,NaN
3,NaN,NaN,103.0,7,10,SA,LOST,LONDON,NaN
4,NaN,NaN,168.0,3,8,ZIM,WON,NOTTINGHAM,NaN
...,...,...,...,...,...,...,...,...,...
91,NaN,NaN,123.0,4,10,SCO,WON,EDINBURGH,NaN
92,NaN,NaN,70.0,NR,NR,ZIM,NR,LEEDS,NaN
93,NaN,NaN,213.0,8,5,SA,LOST,BIRMINGHAM,NaN
94,NaN,NaN,253.0,5,6,IND,WON,NOTTINGHAM,NaN
95,NaN,NaN,241.0,7,1,PAK,LOST,MANCHESTER,NaN

In [8]:
wc_1992 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 1992.csv')
wc_1992

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1992.0,NZ,248,6,10,AUS,WON,AUCKLAND,PAKISTAN
2,NaN,NaN,210,4,9,SL,WON,HAMILTON,NaN
3,NaN,NaN,191,3,7,SA,WON,AUCKLAND,NaN
4,NaN,NaN,162,3,7,ZIM,WON,NAPIER,NaN
...,...,...,...,...,...,...,...,...,...
82,NaN,NaN,211,7,8,PAK,WON,BRISBANE,NaN
83,NaN,NaN,164,3,10,ZIM,WON,CANBERRA,NaN
84,NaN,NaN,236,4,7,ENG,LOST,MELBOURNE,NaN
85,NaN,NaN,181,4,6,IND,WON,ADELAIDE,NaN
86,NaN,NaN,232,6,6,ENG,LOST,SYDNEY,NaN

In [9]:
wc_1987 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 1987.csv')
wc_1987

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1987.0,PAK,267.0,6.0,10.0,SL,WON,HYDERABAD,AUSTRALIA
2,NaN,NaN,239.0,7.0,10.0,ENG,WON,RAWALPINDI,NaN
3,NaN,NaN,216.0,9.0,10.0,WI,WON,LAHORE,NaN
4,NaN,NaN,247.0,3.0,9.0,ENG,WON,KARACHI,NaN
...,...,...,...,...,...,...,...,...,...
57,NaN,NaN,139.0,10.0,9.0,AUS,LOST,CHANDIGARH,NaN
58,NaN,NaN,135.0,10.0,2.0,IND,LOST,MUMBAI,NaN
59,NaN,NaN,227.0,5.0,6.0,NZ,LOST,KOLKATA,NaN
60,NaN,NaN,191.0,7.0,3.0,IND,LOST,AHMEDABAD,NaN
61,NaN,NaN,196.0,6.0,5.0,AUS,LOST,CUTTACK,NaN

In [10]:
wc_1983 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 1983.csv')
wc_1983

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1983.0,ENG,322.0,6.0,10.0,NZ,WON,LONDON,INDIA
2,NaN,ENG,339.0,9.0,10.0,SL,WON,TAUNTON,NaN
3,NaN,ENG,199.0,2.0,8.0,PAK,WON,LONDON,NaN
4,NaN,ENG,234.0,10.0,8.0,NZ,LOST,BIRMINGHAM,NaN
...,...,...,...,...,...,...,...,...,...
57,NaN,WI,282.0,9.0,10.0,IND,WON,LONDON,NaN
58,NaN,WI,276.0,3.0,6.0,AUS,WON,LONDON,NaN
59,NaN,WI,172.0,0.0,10.0,ZIM,WON,BIRMINGHAM,NaN
60,NaN,WI,188.0,2.0,8.0,PAK,WON,LONDON,NaN
61,NaN,WI,140.0,10.0,10.0,IND,LOST,LONDON,NaN

In [11]:
wc_1979 = pd.read_csv('../Dataset/cricketWorldcup/CRICKET WORLD CUP - 1979.csv')
wc_1979

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1979.0,IND,190.0,10,1,WI,LOST,BIRMINGHAM,WEST INDIES
2,NaN,IND,182.0,10,2,NZ,LOST,LEEDS,NaN
3,NaN,IND,238.0,10,5,SL,LOST,MANCHESTER,NaN
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,NaN,WI,190.0,10,1,IND,WON,BIRMINGHAM,NaN
6,NaN,WI,NaN,NR,NR,SL,NR,LONDON,NaN
7,NaN,WI,244.0,7,9,NZ,WON,NOTTINGHAM,NaN
8,NaN,WI,293.0,6,10,PAK,WON,LONDON,NaN
9,NaN,WI,286.0,9,10,ENG,WON,LONDON,NaN
10,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
11,NaN,NZ,190.0,1,10,SL,WON,NOTTINGHAM,NaN
12,NaN,NZ,183.0,2,10,IND,WON,LEEDS,NaN
13,NaN,NZ,212.0,9,7,WI,LOST,NOTTINGHAM,NaN
14,NaN,NZ,212.0,9,8,ENG,LOST,MANCHESTER,NaN
15,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
16,NaN,SL,189.0,10,1,NZ,LOST,NOTTINGHAM,NaN
17,NaN,SL,NaN,NR,NR,WI,NR,LONDON,NaN
18,NaN,SL,238.0,5,10,IND,WON,MANCHESTER,NaN
19,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
20,NaN,ENG,160.0,4,9,AUS,WON,LONDON,NaN
21,NaN,ENG,46.0,2,10,CAN,WON,MANCHESTER,NaN
22,NaN,ENG,165.0,9,10,PAK,WON,LEEDS,NaN
23,NaN,ENG,221.0,8,9,NZ,WON,MANCHESTER,NaN
24,NaN,ENG,194.0,9,10,WI,LOST,LONDON,NaN
25,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
26,NaN,AUS,159.0,9,4,ENG,LOST,LONDON,NaN
27,NaN,AUS,197.0,10,7,PAK,LOST,NOTTINGHAM,NaN
28,NaN,AUS,106.0,3,10,CAN,WON,BIRMINGHAM,NaN
29,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
30,NaN,CAN,139.0,9,2,PAK,LOST,LEEDS,NaN
31,NaN,CAN,45.0,10,2,ENG,LOST,MANCHESTER,NaN
32,NaN,CAN,105.0,10,3,AUS,LOST,BIRMINGHAM,NaN
33,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
34,NaN,PAK,140.0,2,9,CAN,WON,LEEDS,NaN
35,NaN,PAK,286.0,7,10,AUS,WON,NOTTINGHAM,NaN
36,NaN,PAK,151.0,10,9,ENG,LOST,LEEDS,NaN
37,NaN,PAK,250.0,10,6,WI,LOST,LONDON,NaN

In [12]:
joint = pd.concat([wc_2019.fillna(method='bfill'), wc_2015.fillna(method='bfill'),wc_2011.fillna(method='bfill'),wc_2007.fillna(method='bfill'),wc_2003.fillna(method='bfill'),wc_1999.fillna(method='bfill'),wc_1992.fillna(method='bfill'),wc_1987.fillna(method='bfill'),wc_1983.fillna(method='bfill'),wc_1979.fillna(method='bfill')],axis=0)

C:\Users\rouna\AppData\Local\Temp\ipykernel_15844\156330580.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  joint = pd.concat([wc_2019.fillna(method='bfill'), wc_2015.fillna(method='bfill'),wc_2011.fillna(method='bfill'),wc_2007.fillna(method='bfill'),wc_2003.fillna(method='bfill'),wc_1999.fillna(method='bfill'),wc_1992.fillna(method='bfill'),wc_1987.fillna(method='bfill'),wc_1983.fillna(method='bfill'),wc_1979.fillna(method='bfill')],axis=0)

In [13]:
joint

,YEAR,TEAM,RUNS SCORED,WICKETS LOST,WICKETS TAKEN,AGAINST,RESULT,VENUE,WINNER
0,2019.0,ENG,311,8,10,SA,WON,LONDON,ENGLAND
1,2019.0,ENG,311,8,10,SA,WON,LONDON,ENGLAND
2,NaN,SA,334,9,8,PAK,LOST,NOTTINGHAM,NaN
3,NaN,SA,386,6,10,BAN,WON,CARDIFF,NaN
4,NaN,SA,231,2,10,WI,WON,SOUTHAMPTON,NaN
...,...,...,...,...,...,...,...,...,...
33,NaN,PAK,140.0,2,9,CAN,WON,LEEDS,NaN
34,NaN,PAK,140.0,2,9,CAN,WON,LEEDS,NaN
35,NaN,PAK,286.0,7,10,AUS,WON,NOTTINGHAM,NaN
36,NaN,PAK,151.0,10,9,ENG,LOST,LEEDS,NaN
37,NaN,PAK,250.0,10,6,WI,LOST,LONDON,NaN

In [14]:
joint.drop(labels='RUNS SCORED',axis=1,inplace=True)
joint.drop(labels='WICKETS LOST',axis=1,inplace=True)
joint.drop(labels='WICKETS TAKEN',axis=1,inplace=True)
joint.drop(labels='AGAINST',axis=1,inplace=True)
joint.drop(labels='RESULT',axis=1,inplace=True)
joint.drop(labels='VENUE',axis=1,inplace=True)

In [15]:
joint

      YEAR TEAM   WINNER
0   2019.0  ENG  ENGLAND
1   2019.0  ENG  ENGLAND
2      NaN   SA      NaN
3      NaN   SA      NaN
4      NaN   SA      NaN
..     ...  ...      ...
33     NaN  PAK      NaN
34     NaN  PAK      NaN
35     NaN  PAK      NaN
36     NaN  PAK      NaN
37     NaN  PAK      NaN

[915 rows x 3 columns]

In [16]:
winner = joint.dropna()
winner

     YEAR TEAM       WINNER
0  2019.0  ENG      ENGLAND
1  2019.0  ENG      ENGLAND
0  2015.0   NZ    AUSTRALIA
1  2015.0   NZ    AUSTRALIA
0  2011.0  BAN        INDIA
1  2011.0  BAN        INDIA
0  2007.0   WI    AUSTRALIA
1  2007.0   WI    AUSTRALIA
0  2003.0   SA    AUSTRALIA
1  2003.0   SA    AUSTRALIA
0  1999.0  ENG    AUSTRALIA
1  1999.0  ENG    AUSTRALIA
0  1992.0   NZ     PAKISTAN
1  1992.0   NZ     PAKISTAN
0  1987.0  PAK    AUSTRALIA
1  1987.0  PAK    AUSTRALIA
0  1983.0  ENG        INDIA
1  1983.0  ENG        INDIA
0  1979.0  IND  WEST INDIES
1  1979.0  IND  WEST INDIES

In [17]:
winner.drop_duplicates('YEAR')

     YEAR TEAM       WINNER
0  2019.0  ENG      ENGLAND
0  2015.0   NZ    AUSTRALIA
0  2011.0  BAN        INDIA
0  2007.0   WI    AUSTRALIA
0  2003.0   SA    AUSTRALIA
0  1999.0  ENG    AUSTRALIA
0  1992.0   NZ     PAKISTAN
0  1987.0  PAK    AUSTRALIA
0  1983.0  ENG        INDIA
0  1979.0  IND  WEST INDIES